Documents/Questionnaire.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Questionnaire</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Definition</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutletsSelected</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SRsSelected</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.QuestionnareStatus</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutletType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.OutletType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutletClass</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.OutletClass</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Scale</Name>
					<Type>
						<v8:Type>cfg:EnumRef.QuestionnaireScale</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BeginDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EndDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Schedule</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Single</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Owner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.User</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FillPeriod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.QuestionsSaveIntervals</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SKUSourceType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SKUSourceTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Questions</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Question</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Question</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SKUs</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>SKU</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.SKU</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SKUQuestions</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>SKUQuestion</Name>
							<Type>
								<v8:Type>cfg:EnumRef.SKUQuestions</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UseInQuestionaire</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Territories</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Territory</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Territory</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Selectors</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>AdditionalParameter</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.OutletParameter</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ComparisonType</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ComparisonType</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Selector</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Brands</v8:Type>
								<v8:Type>cfg:CatalogRef.Outlet</v8:Type>
								<v8:Type>cfg:CatalogRef.Region</v8:Type>
								<v8:Type>cfg:CatalogRef.Positions</v8:Type>
								<v8:Type>cfg:EnumRef.OutletStatus</v8:Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>cfg:CatalogRef.OutletType</v8:Type>
								<v8:Type>cfg:CatalogRef.OutletParameter</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:Type>cfg:CatalogRef.Distributor</v8:Type>
								<v8:Type>cfg:CatalogRef.OutletClass</v8:Type>
								<v8:Type>cfg:CatalogRef.Territory</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>StringValue</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SRs</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>SR</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.User</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Distributor.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Distributor</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ExternalId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Regions</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Region</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Region</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Territories</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Territory</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Territory</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Contacts</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Contact</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContactPersons</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NotActual</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Contractors</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Contractor</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Contractors</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Default</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/Questionnaire/Forms/SelectorsListForm/Ext/Form/Module.bsl
#Region CommonProcedureAndFunctions

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	StringNumber 	= Parameters.StringNumber;
    Selector 		= Parameters.Selector;
    DataType 		= Parameters.DataType;
    OutletParameter = Parameters.OutletParameter;
	Source			= Parameters.Source;
	
    If TypeOf(Parameters.CurrentValue) = Type("ValueList") Then
		
		For Each Element In Parameters.CurrentValue Do
			
			AddRow = Values.Add();
			AddRow.ValueRow = Element.Value;
			
		EndDo;
		
	EndIf;
	If Selector = "Catalog_OutletParameter" Then
		ThisForm.Items.ValuesTableSelect.Visible = False;
	EndIf;
    
EndProcedure

&AtServer
Function IsOutletParameter(Value)
    
    If Value = "Catalog_OutletParameter" Then
		
		Return True;
		
	Else
		
		Return False;    	    
		
	EndIf; 
    
EndFunction

#EndRegion

#Region UserInterface

&AtClient
Procedure Ok(Command)

    List = new ValueList;
	
	For Each Element In Values Do
		
		List.Add(Element.ValueRow);    	    
		
	EndDo;

    ReturnStructure = New Structure("StringNumber, List", StringNumber, List);    
	
	Notify(Source, ReturnStructure, ThisForm);
	
	Close();
	
EndProcedure

&AtClient
Procedure ValuesValueRowStartChoice(Item, ChoiceData, StandardProcessing)
	
	StandardProcessing = False;
	
	If Not IsOutletParameter(Selector) Then
		
		Str = StrReplace(Selector, "_", ".");
        OpenForm(Str + ".ChoiceForm", , Item, , , , , FormWindowOpeningMode.LockWholeInterface);    	    
		
	Else
		
		OpenForm("Document.Questionnaire.Form.Input", New Structure("StringNumber, DataType, OutletParameter, Source, CurrentValue", Items.ValuesTable.CurrentData.GetID(), DataType, OutletParameter, "ListForm", Items.ValuesTable.CurrentData.ValueRow));                
		
	EndIf;    
	
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	
	If EventName = "ListForm" Then                       
		
		Items.ValuesTable.CurrentData.ValueRow = Parameter.Str;
		
	EndIf;
	
EndProcedure

&AtClient
Procedure ValuesTableBeforeEditEnd(Item, NewRow, CancelEdit, Cancel)
	
	If Not CancelEdit Then 
	
		If Not ValueIsFilled(Items.ValuesTable.CurrentData.ValueRow) Then 
			
			Message(NStr("en='Value is not selected';ru='Значение не выбрано';cz='Nebyla zvolena žádná hodnota'"));
			
			Cancel = True;
			
		EndIf;
		
	EndIf;
		
EndProcedure

&AtClient
Procedure Select(Command)
	NewString=Items.ValuesTable;
	FormParameters = New Structure;
	FormParameters.Insert("CloseOnChoice", False);
	FormParameters.Insert("CloseOnOwnerClose", True);
	ParametrsForm=New Structure("ChoiceMode", True);
	ParametrsForm=New Structure("CloseOnChoice", False);
	If Selector = "Catalog_Region" Then
		OpenForm("Catalog.Region.ChoiceForm",ParametrsForm, NewString, , , , , FormWindowOpeningMode.LockWholeInterface);	
	EndIf;
	If Selector = "Catalog_Outlet" Then
		OpenForm("Catalog.Outlet.ChoiceForm",ParametrsForm, NewString, , , , , FormWindowOpeningMode.LockWholeInterface);
	EndIf;
	If Selector = "Enum_OutletStatus" Then
		OpenForm("Enum.OutletStatus.ChoiceForm",ParametrsForm, NewString, , , , , FormWindowOpeningMode.LockWholeInterface);
	EndIf;
	If Selector = "Catalog_OutletType" Then
		OpenForm("Catalog.OutletType.ChoiceForm",ParametrsForm, NewString, , , , , FormWindowOpeningMode.Independent);
	EndIf;
	If Selector = "Catalog_OutletClass" Then
		OpenForm("Catalog.OutletClass.ChoiceForm",ParametrsForm, NewString, , , , , FormWindowOpeningMode.LockWholeInterface);
	EndIf;
	If Selector = "Catalog_Distributor" Then
		OpenForm("Catalog.Distributor.ChoiceForm",ParametrsForm, NewString, , , , , FormWindowOpeningMode.LockWholeInterface);
	EndIf;
	If Selector = "Catalog_Territory" Then
		OpenForm("Catalog.Territory.ChoiceForm",ParametrsForm, NewString, , , , , FormWindowOpeningMode.LockWholeInterface);
	EndIf;
	If Selector = "Catalog_Positions" Then
		OpenForm("Catalog.Positions.ChoiceForm",ParametrsForm, NewString, , , , , FormWindowOpeningMode.LockWholeInterface);
	EndIf;
//	If Selector = "Catalog_OutletParameter" Then
//		OpenForm("Catalog.OutletParameter.ChoiceForm",ParametrsForm, NewString, , , , , FormWindowOpeningMode.LockWholeInterface);
//	EndIf;
	
EndProcedure

&AtClient
Procedure ValuesTableChoiceProcessing(Item, SelectedValue, StandardProcessing)
	
	Coincidence=False;
	For Each Row In Values Do
		If SelectedValue=Row.ValueRow Then
			Coincidence=True;	
		EndIf;
	EndDo;
	If Not(Coincidence) Then
	NewString=Values.Add();
	NewString.ValueRow=SelectedValue;
	EndIf;
	// Вставить содержимое обработчика.
EndProcedure

&AtClient
Procedure AddValue(Command)
	NewString=Items.ValuesTable;
	If Selector = "Catalog_Region" Then
		OpenForm("Catalog.Region.ChoiceForm",, NewString, , , , , FormWindowOpeningMode.LockWholeInterface);	
	EndIf;
	If Selector = "Catalog_Outlet" Then
		OpenForm("Catalog.Outlet.ChoiceForm",, NewString, , , , , FormWindowOpeningMode.LockWholeInterface);
	EndIf;
	If Selector = "Enum_OutletStatus" Then
		OpenForm("Enum.OutletStatus.ChoiceForm",, NewString, , , , , FormWindowOpeningMode.LockWholeInterface);
	EndIf;
	If Selector = "Catalog_OutletType" Then
		OpenForm("Catalog.OutletType.ChoiceForm",, NewString, , , , , FormWindowOpeningMode.LockWholeInterface);
	EndIf;
	If Selector = "Catalog_OutletClass" Then
		OpenForm("Catalog.OutletClass.ChoiceForm",, NewString, , , , , FormWindowOpeningMode.LockWholeInterface);
	EndIf;
	If Selector = "Catalog_Distributor" Then
		OpenForm("Catalog.Distributor.ChoiceForm",, NewString, , , , , FormWindowOpeningMode.LockWholeInterface);
	EndIf;
	If Selector = "Catalog_Territory" Then
		OpenForm("Catalog.Territory.ChoiceForm",, NewString, , , , , FormWindowOpeningMode.LockWholeInterface);
	EndIf;
	If Selector = "Catalog_Positions" Then
		OpenForm("Catalog.Positions.ChoiceForm",, NewString, , , , , FormWindowOpeningMode.LockWholeInterface);
	EndIf;
	If Selector = "Catalog_OutletParameter" Then
		InputFormParameters = New Structure;
		InputFormParameters.Insert("StringNumber", 0);
		InputFormParameters.Insert("OutletParameter", OutletParameter);
		InputFormParameters.Insert("PreviousValue", "");

		OpenForm("CommonForm.OutletParameterValueInputForm",InputFormParameters, ThisForm, , , ,New NotifyDescription("OutletParameterValueInputProcessing", ThisForm) , FormWindowOpeningMode.LockWholeInterface);
	EndIf;
EndProcedure
&AtClient
Procedure OutletParameterValueInputProcessing(Result, AdditionalParameter) Export
	
	If Result = Undefined Then
		
//		Items.Parameters.EndEditRow(True);
		
	Else
		
		ObjectRow = ThisForm.Values.Add();
		ObjectRow.ValueRow = Result.Str;
//		ObjectRow.Value = Result.Str;
//		ObjectRow.Presentation = ObjectRow.Value;
		
//		Items.Parameters.EndEditRow(False);
		
//		Modified = True;
		
	EndIf;
	
EndProcedure 
#EndRegion
